DataProcessors/OPERACODE_ЗагрузкаНормировокВремениВыполненияРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>OPERACODE_ЗагрузкаНормировокВремениВыполненияРабот</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКфайлам</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКфайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФайлыКОбработке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлу</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/OPERACODE_СемействаАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>OPERACODE_СемействаАвтомобилей</Name>
			<Comment>Послепродажный код семейства автомобилей - TAPV (можно посмотреть в BVM)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ранг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НаГарантии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>TAPV</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Renault_СемействаАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_СемействаАвтомобилей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлассАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КлассыАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_КодыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/OPERACODE_ЗагрузкаНормировокВремениВыполненияРабот/Ext/ObjectModule.bsl
Перем ФайлыДанных Экспорт; //массив выбранных файлов.
Перем КоличествоСозданных Экспорт; //Счетчик созданных авторабот
Перем ТекДата Экспорт;
Перем СоответствиеМесяцев;

Перем ИмяВрФайлаДрайвера;
Перем МассивВрФайлов;

/////////////////////////////////////////////
//Точка входа

Процедура НайтиФайлыВКаталоге() Экспорт
	
	Если ЗначениеЗаполнено(ПутьКфайлу) тогда
		//Ищем файлы
		Фильтр = "*.OPC.*.*";
		ФайлыДанных = НайтиФайлы(ПутьКфайлу, Фильтр, Истина);
	КонецЕсли;
	
	//Заполняем табличную часть файлами.
	ФайлыКОбработке.Очистить();
	
	Для каждого ФайлДанных из ФайлыДанных Цикл
		НС = ФайлыКОбработке.Добавить();
		НС.ИмяФайла = ФайлДанных.Имя;
		НС.ПутьКФайлу = ФайлДанных.ПолноеИмя;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьФайлы() Экспорт
	
	КоличествоСозданных = 0;
	
	//Выгружаем только отмеченные строки - эти файлы идут в обработку.
	Отбор = Новый Структура("Отметка", Истина);
	ВремТаб = ФайлыКОбработке.Выгрузить(Отбор);
	
	Для каждого СтрокаФайлов из ВремТаб цикл
		
		ТекстовыйДок = Новый ЧтениеТекста(СтрокаФайлов.ПутьКФайлу, КодировкаТекста.UTF8);
		
		СтруктураПараметров = Новый Соответствие;
		СтруктураПараметров.Вставить("ТекстовыйДок", ТекстовыйДок);
		СтруктураПараметров.Вставить("СтрокаФайлов",СтрокаФайлов);
		
		//Соберем список идентификаторов
		
		ИдСтрока = ТекстовыйДок.ПрочитатьСтроку();
		СписокИдентификаторов = ПолучитьИдентификаторы(ИдСтрока);
		
		СтруктураПараметров.Вставить("Локаль",		 СписокИдентификаторов["Локаль"]);
		СтруктураПараметров.Вставить("ДатаДействия", СписокИдентификаторов["ДатаДействия"]);
		СтруктураПараметров.Вставить("ТекстовыйДок", ТекстовыйДок);
		
		//Общие обработки завершены. теперь нужно вызвать правильные обработчик 
		//для V2 и V3
		
		Обработчик = ПолучитьДрайверОбработчикФайла(СписокИдентификаторов["Версия"]);
		
		Если НЕ обработчик = Неопределено тогда
			//предаем путь к файлу
			Обработчик.Параметры = СтруктураПараметров;
			
			Обработчик.ОбработатьФайл();
			КоличествоСозданных = КоличествоСозданных + Обработчик.КоличествоСозданных;
		КонецЕсли;
		
		Обработчик = Неопределено;
		
		//Закрываем файл
		ТекстовыйДок.Закрыть();
		ТекстовыйДок = Неопределено;
		
		//Переименуем файл, чтрбы больше его не загружать
		ПереименоватьФайл(СтрокаФайлов);
		
	КонецЦикла;
	
	//Почему решено отказаться от справочника в пользу регистра сейчас уже не вспомнить.
	//Теперь необходимо записи из регистра Семейства автомобилей перенести в одноименный справочник 
	
	//Переносим все новые
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	OPERACODE_СемействаАвтомобилей.TAPV КАК Код,
	|	OPERACODE_СемействаАвтомобилей.Ранг КАК КлассАвтомобиля,
	|	OPERACODE_СемействаАвтомобилей.НаГарантии КАК Гарантия
	|ИЗ
	|	РегистрСведений.OPERACODE_СемействаАвтомобилей КАК OPERACODE_СемействаАвтомобилей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_СемействаАвтомобилей КАК СемействаАвтомобилей
	|		ПО OPERACODE_СемействаАвтомобилей.TAPV = СемействаАвтомобилей.Код
	|ГДЕ
	|	СемействаАвтомобилей.Ссылка ЕСТЬ NULL "
	;
	
	ТаблицаTAPV = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТаблицы из ТаблицаTAPV Цикл
		
		ЭлементTAPV = Справочники.Renault_СемействаАвтомобилей.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(ЭлементTAPV, СтрокаТаблицы);
		
		//Установим ранг
		Если СтрокаТаблицы.КлассАвтомобиля = 0 тогда
			СсылкаКлассАвтомобиля = Справочники.Renault_КлассыАвтомобилей.ПустаяСсылка();
		Иначе
			СсылкаКлассАвтомобиля = Справочники.Renault_КлассыАвтомобилей["Ранг_" + СтрокаТаблицы.КлассАвтомобиля].Ссылка;
		КонецЕсли;
		
		ЭлементTAPV.КлассАвтомобиля = СсылкаКлассАвтомобиля;
		
		ЭлементTAPV.Записать();
		
	КонецЦикла;
	
	//Переносим все измененные
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	OPERACODE_СемействаАвтомобилей.TAPV КАК Код,
	|	OPERACODE_СемействаАвтомобилей.Ранг КАК КлассАвтомобиля,
	|	OPERACODE_СемействаАвтомобилей.НаГарантии КАК Гарантия,
	|	ВЫБОР
	|		КОГДА OPERACODE_СемействаАвтомобилей.НаГарантии = СемействаАвтомобилей.Гарантия
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НужноОбновление,
	|	СемействаАвтомобилей.Ссылка КАК СсылкаНаЭлемент
	|ПОМЕСТИТЬ ВремТЗ
	|ИЗ
	|	РегистрСведений.OPERACODE_СемействаАвтомобилей КАК OPERACODE_СемействаАвтомобилей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_СемействаАвтомобилей КАК СемействаАвтомобилей
	|		ПО OPERACODE_СемействаАвтомобилей.TAPV = СемействаАвтомобилей.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТЗ.Код,
	|	ВремТЗ.КлассАвтомобиля,
	|	ВремТЗ.Гарантия,
	|	ВремТЗ.СсылкаНаЭлемент
	|ИЗ
	|	ВремТЗ КАК ВремТЗ
	|ГДЕ
	|	ВремТЗ.НужноОбновление = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТЗ"
	;
	
	ТаблицаTAPV = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТаблицы из ТаблицаTAPV Цикл
		
		ЭлементTAPV = СтрокаТаблицы.СсылкаНаЭлемент.ПолучитьОбъект();
		
		//Установим ранг
		Если СтрокаТаблицы.КлассАвтомобиля = 0 тогда
			СсылкаКлассАвтомобиля = Справочники.Renault_КлассыАвтомобилей.ПустаяСсылка();
		Иначе
			СсылкаКлассАвтомобиля = Справочники.Renault_КлассыАвтомобилей["Ранг_" + СтрокаТаблицы.КлассАвтомобиля].Ссылка;
		КонецЕсли;
		
		ЭлементTAPV.КлассАвтомобиля  = СсылкаКлассАвтомобиля;
		ЭлементTAPV.Гарантия		 = СтрокаТаблицы.Гарантия;
		
		ЭлементTAPV.Записать();
		
	КонецЦикла;
	
	//Теперь нужно выполнить чистку системы от использованных файлов внешних обработок
	Попытка
		Для каждого ВрФайл Из МассивВрФайлов Цикл
			
			УдалитьФайлы(ВрФайл);
			
		КонецЦикла;
	Исключение КонецПопытки;

	
КонецПроцедуры

Функция ПолучитьДрайверОбработчикФайла(Версия)
	
	Если Версия = "2" тогда
		
		ДвоичныеДанныеДрайвера = ЭтотОбъект.ПолучитьМакет("V2");
		
		//Сохраняем во временный файл
		ИмяВрФайлаДрайвера = ПолучитьИмяВременногоФайла("epf");
		ДвоичныеДанныеДрайвера.Записать(ИмяВрФайлаДрайвера);
		
		МассивВрФайлов.Добавить(ИмяВрФайлаДрайвера);
		
		//Теперь подключаем обработку к системе
		Возврат ВнешниеОбработки.Создать(ИмяВрФайлаДрайвера);
		
	ИначеЕсли Версия = "3" тогда
		
		ДвоичныеДанныеДрайвера = ЭтотОбъект.ПолучитьМакет("V3");
		
		//Сохраняем во временный файл
		ИмяВрФайлаДрайвера = ПолучитьИмяВременногоФайла("epf");
		ДвоичныеДанныеДрайвера.Записать(ИмяВрФайлаДрайвера);
		
		МассивВрФайлов.Добавить(ИмяВрФайлаДрайвера);
		
		//Теперь подключаем обработку к системе
		Возврат ВнешниеОбработки.Создать(ИмяВрФайлаДрайвера);
		
	Иначе 
		возврат Неопределено
	КонецЕсли;
	
КонецФункции


/////////////////////////////////////////////
//Точка входа сервера

Процедура ОбработкаНаСервере() Экспорт
	
	НайтиФайлыВКаталоге();
	
	//Помечаем все файлы для загрузки
	ВремТЗ = ФайлыКОбработке.Выгрузить();
	ВремТЗ.ЗаполнитьЗначения(Истина, "отметка");
	ФайлыКОбработке.Загрузить(ВремТЗ);
	
	//Уничтожаем временную таблицу
	ВремТЗ = Неопределено;
	
	//Запускаем обработку
	ОбработатьФайлы();
	
КонецПроцедуры

////////////////////////////////////////
//Вспомогательные функции

Процедура ПереименоватьФайл(СтрокаФайлов)
	
	ФайлОбъект = Новый Файл(СтрокаФайлов.ПутьКФайлу);
	
	ИмяБезРасширения = СтрЗаменить(ФайлОбъект.ИмяБезРасширения,".OPC.",".OP_.");
	Путь			 = ФайлОбъект.Путь;
	Расширение		 = ФайлОбъект.Расширение;
	
	ФайлОбъект = Неопределено;
	
	ПереместитьФайл(СтрокаФайлов.ПутьКФайлу, Путь+ИмяБезРасширения+Расширение);
	
КонецПроцедуры

//функция получает строковую дату "01/MARS/2011" и преобразует 
//в дату внутреннего представления "01.03.2011 00:00:00"
Функция ПреобразоватьВДату(ДатаСтрокой)
	
	ДатаДень = Лев(ДатаСтрокой,2);
	ДатаМесяц = СоответствиеМесяцев[Сред(ВРег(ДатаСтрокой),4,4)];
	ДатаГод = Прав(ДатаСтрокой, 4);
	
	//Присвоим эту дату переменной ТекДата
	ТекДата = Дата(ДатаГод, ДатаМесяц, ДатаДень);
	Возврат ТекДата;
КонецФункции


////////////////////////////////////////
//Основные функции обработки файлов

Функция ПолучитьИдентификаторы(ИдСтрока)
	
	Renault_Открытый.СостояниеДляПользователя("Считывание идентификаторов файла");
	
	СписокИдентификаторов = Новый Соответствие;
	
	СписокИдентификаторов.Вставить("Локаль", Сред(ИдСтрока, 19, 2));
	СписокИдентификаторов.Вставить("ДатаДействия", ПреобразоватьВДату(Сред(ИдСтрока, 22, 12)));
	СписокИдентификаторов.Вставить("Версия", Сред(ИдСтрока, 15, 1));
	
	Возврат СписокИдентификаторов;
	
КонецФункции

/////////////////////////////////////////
//Блок первоначальной инициализации

СоответствиеМесяцев = Новый Соответствие;
СоответствиеМесяцев.Вставить("JANV",1);
СоответствиеМесяцев.Вставить("FEVR",2);
СоответствиеМесяцев.Вставить("MARS",3);
СоответствиеМесяцев.Вставить("AVRI",4);
СоответствиеМесяцев.Вставить("MAI ",5);
СоответствиеМесяцев.Вставить("JUIN",6);
СоответствиеМесяцев.Вставить("JUIL",7);
СоответствиеМесяцев.Вставить("AOUT",8);
СоответствиеМесяцев.Вставить("SEPT",9);
СоответствиеМесяцев.Вставить("OCTO",10);
СоответствиеМесяцев.Вставить("NOVE",11);
СоответствиеМесяцев.Вставить("DECE",12);

МассивВрФайлов = Новый Массив;
